// --- Operators ----

/* Task - 1
Create variable named myAge and set its value equal your agw
Display the sum of myAge + 30, using two variables: x and y. */

/* Task - 2
Create variable named dividedNumber and set its value equal myAge divided by 2
 * NOTE: you should use myAge variable here */

/* Task - 3
Create variable named multipleNumber and set its value equal myAge multiply by 2 */

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------

// --- 'if' conditional ---

/* Task - 4
 Створіть програму, яка буде зберігати значення ваги кота.
Якщо кіт важить менше 5 кг, то він маленький і його ще треба годувати,
якщо більше 5, то кіт дуже пухнастий і його потрібно розчесати :)

Переписати інструкцію if з використанням умовного оператора '?
*/

/* Task - 5
Напишіть умову if, яка перевіряє, чи значення віку НЕ знаходиться між 18 і 50 включно, якщо це не так, то наймайте.

Переписати інструкцію if з використанням умовного оператора '?

%%% https://www.tiktok.com/@devslopes/video/7260261089928105258 %%%%
*/


/* Task - 6
Переписати інструкцію if з використанням умовного оператора '?

if (height < 140) {
 console.log("Заборонено на атракціон");
} else {
   console.log("Проходьте, будь ласка!");
}
*/


/* Task - 7
Створіть сценарій. Запросіть у користувача вік. Якщо вік користувача більше ніж 18
– виведіть на екран повідомлення «доступ дозволено». Якщо введене користувачем значення
менше ніж 18 – виведіть на екран повідомлення «доступ заборонено»
 */

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------

// --- 'switch' conditinal ---

/* Task - 8
Напишіть програму, яка буде показувати, до якої пори року належить певний номер місяця
(наприклад, я вводжу "1" і вона повідомляє мені, що зараз зима, вводжу "5" - весна і т.д.). */


/* Task - 9
Перепишіть "if" на "switch"

let age = 16;
if (age < 16) {
    console.log( 'We cant hire u!' );
}
if (age >= 18) {
  console.log( 'U can take full time job' );
}

if (age == 16 || a == 17) {
  console.log( 'U can take part time job' );
}
*/

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------