/* Task - 1
  Напишіть функцію getFirstChar(str), яка повертає рядок str з першим символом у верхньому регістрі,
  наприклад:
  я даю слово "кіт", а мені повертаеться "Кіт"
  *Підказка: використайте slice */

/* Task - 2
  Напишіть функцію checkSpam(str), яка повертає true, якщо str містить ‘forex’ or ‘crypto’, інакше false
  Функція має бути нечутливою до регістру
  / / / https://www.tiktok.com/@devslopes/video/7154123361671466283 / / / */

/* Task - 3
  У нас є вартість у вигляді "$120". Тобто: спочатку йде знак долара, а потім число.
  Створіть функцію extractCurrencyValue(str), яка витягне числове значення з такого рядка та поверне його.
  *Підказка: використайте slice */