/* Task - 1
Створіть об'єкт "Людина" з щонайменше трьома властивостями (рік, ім'я, прізвище).
Завдання:
- Напишіть метод getInfo(), який виводитиме всі властивості об'єкта у вигляді пар "ключ: значення".
- Напишіть метод sayHello, який виведе на екран повідомлення «Привіт, мене звуть X, мені
Y років.»

https://www.tiktok.com/@p.mnhv/video/7273404141962153221 */

/* Task - 2
   Створіть функцію createRobot, яка створить об'єкт "robot" з об'єкта "person",
   додавши додаткову властивість до об'єкта "person".
   "Robot" повинен мати властивість "batteryEnergy" (наприклад, batteryEnergy = 50)

 * ПРИМІТКА: використовуйте метод присвоєння об'єктів (Object.assign)
   https://uk.javascript.info/object-copy */


/* Task - 3
   Створіть isARobot, який буде перевіряти, чи є об'єкт роботом
   перевіркою наявності у об'єкта властивості (batteryEnergy) */

/* Task - 4
Припустимо, у нас є об'єкт. Властивості об'єкта - назва послуги та її вартість:

var services = {
	"стрижка": "60",
	"гоління": "80",
	"Миття голови": "100"
};

Завдання:
- створити метод price(), який обчислює та повертає загальну вартість "наданих послуг".
- створити метод minPrice() - який повертає мінімальний price
- створити метод maxPrice() - який повертає максимальний price */