/*
Вам необхідно намалювати в консолі прямокутний трикутник із зірочок (або плюсиків, або якогось іншого
символу): на першому рядку - одна зірочка, на другій дві, і так далі. Рішення оформіть у вигляді
функції, куди передаються два параметри: висота трикутника та символ, яким його потрібно "малювати".
Приклад:
drawTriangle(5, *);
  *
  **
 ***
 ****

Умови виконання ДЗ
1. Домашню роботу необхідно зробити двома способами
2. В задачі не потрібно використовувати prompt або щось інше повязане з UI
3. Не використовувати функції або інші матеріали які ми не вивчали
4. Намагайтесь робити ДЗ самостійно та не дивитися будьякі підказки
Будь ласка, надайте наступні дані для перевірки вашої роботи:
1. Створіть гілку js_homework3.
2. Додати туди ваше домашне завдання
3. Вислати вашу гілку
 */
