/*
Умови виконання ДЗ
1. Домашню роботу необхідно зробити двома способами
2. В задачі не потрібно використовувати prompt або щось інше повязане з UI
3. Не використовувати функції або інші матеріали які ми не вивчали
4. Намагайтесь робити ДЗ самостійно та не дивитися будьякі підказки
Будь ласка, надайте наступні дані для перевірки вашої роботи:
1. Створіть гілку js_homework3.
2. Додати туди ваше домашне завдання
3. Вислати вашу гілку
 */

/*
ДЗ 5. Ялинка
Вам необхідно намалювати в консолі прямокутний трикутник із зірочок (або плюсиків, або якогось іншого
символу): на першому рядку - одна зірочка, на другій дві, і так далі. Рішення оформіть у вигляді
функції, куди передаються два параметри: висота трикутника та символ, яким його потрібно "малювати".
Приклад: drawTriangle(5, *);
 */

/*
ДЗ 6. Кратність чисел
Вивести на екран суму чисел від 1 до 100 включно, які не кратні 3.
 */

/*
ДЗ 7. Написати функцію pow
Опис ДЗ: Написати функцію pow(x,y) яка буде приймати 2 цисла, перше це число яке ми будемо зводити у ступінь,
друге у яку ступінь.
Наприклад pow(2,3) функція поверне значення 8.
Умови виконання ДЗ
1. Не використовувати **
*/