/* Будь ласка, надайте наступні дані для перевірки вашої роботи:
1. Створіть гілку js_homework7.
2. Додати туди ваше домашне завдання
3. Вислати вашу гілку */

/* Умови виконання ДЗ
1. Не використовувати функції або інші матеріали які ми не вивчали
2. Намагайтесь робити ДЗ самостійно та не дивитися будьякі підказки
 */

/* ДЗ 1. Без А
Опис ДЗ: Напишіть регулярний вираз,який допоможе знайти принаймні шість символів і не містяти літери А
(великої або малої)
 */

let pattern = /^[^Aa]{6,}$/

/* ДЗ 2. Параноя
Опис ДЗ: В нас є масив обєктів в яких міститься email.
У нас параноя, ми не довіряємо жодним адресам, окрім зареєстрованих на доменах gmail.com та yahoo.com.
За допомогою регулярного виразу створіть масив з адресами, гідними довіри. Постарайтеся також зробити
просту валідацію до @ одне, або два слова які можуть містити (латинські букви, цифри) яке може бути розділене крапкою.
 */

let arr = [
    {
        userName: "Test",
        lastName: "Test",
        email: "test.test@gmail.com"
    },
    {
        userName: "Dmitro",
        lastName: "Porohov",
        email: "dmitro.porohov@yahoo.com"
    },
    {
        userName: "Andrii",
        lastName: "",
        email: "andrii@mail.ru" // Нам такі не підходять
    },
];

// let emailRegex = /^[a-zA-Z0-9._%+-]+?@(gmail|yahoo)\.com$/;
let emailRegex = /^[a-zA-Z0-9]+(\.[a-zA-Z0-9]+)?@(gmail|yahoo)\.com$/;

let trustedEmails = [];

arr.forEach(item => {
    if (emailRegex.test(item.email)) {
        trustedEmails.push(item.email);
    }
});

console.log(trustedEmails);
