/* Умови виконання ДЗ
1. Не використовувати функції або інші матеріали які ми не вивчали
2. Намагайтесь робити ДЗ самостійно та не дивитися будьякі підказки
Будь ласка, надайте наступні дані для перевірки вашої роботи:
1. Створіть гілку js_homework4.
2. Додати туди ваше домашне завдання
3. Вислати вашу гілку */

// # 10.
/* Опис ДЗ: Необхідно написати власну реалізацію функцій padEnd та padStart, але у вас повинна бути одна
функція pad(‘qwerty’, ‘+’, true), яка приймає чотири аргументи:
- рядок, до якого буде додаватися символ.
- символ, який буде додаватися.
- Скільки додавати символів
- булеве значення, яке вказує, куди додавати символ. Якщо true, то до початку, якщо false, то в кінець.
Останній аргумент повинен працювати як і в оригінальній функції, а саме якщо наш рядок з 5 символів, а ви
вказуєте знаачення 6, то додаєте тільки один символ
Умови виконання ДЗ
- Функція повина повертати новий рядок */

// # 11.
/* Опис ДЗ: Написати свою реалізацію функції isNaN.
Умови виконання ДЗ
- Не викорисутовувати isNaN/ Number.isNaN */

// # 12.
/*
Опис ДЗ: Перевірка теорії ймовірності. Напишіть функцію яка буде генерувати певну кількість випадкових
чисел в діапазоні від 100 до 1000 включно. Порахувати кількість парних та непарних серед них. Обчислити
відсоткове співвідношення - чи буде воно близьке до 50%50? Приклад функції checkProbabilityTheory(count).
Параметр count буде вказувати скільки разів буде генеруватися випадкове число.
Умови виконання ДЗ
1. Функція виводить інформацію
2. Кількість згенерованих чисел: кількість чисел
3. Парних чисел: кількість парних чисел
4. Не парних чисел: кількість не парних чисел
5. Відсоток парних до не парних: */