/* Необхідно написати програму яка буде виводити інформацію за умовами при яких число виводитиметься
з правильним словом: "рік", "роки" або "років". Тобто. "29 років" чи "4 роки".

Умови виконання ДЗ
1. Рік отримувати через prompt()
2. Зробити перевірку що користувачь ввів число та це число не є відємним
3. Не використовувати функції або інші матеріали які ми не вивчали
4. Намагайтесь робити ДЗ самостійно та не дивитися будьякі підказки.

Будь ласка, надайте наступні дані для перевірки вашої роботи:
1. Створіть гілку js_homework2.
2. Додати туди ваше домашне завдання
3. Вислати вашу гілку */
