/* Будь ласка, надайте наступні дані для перевірки вашої роботи:
1. Створіть гілку js_homework5.
2. Додати туди ваше домашне завдання
3. Вислати вашу гілку */

/* Умови виконання ДЗ
1. Не використовувати функції або інші матеріали які ми не вивчали
2. Не використовувати методи keys, values, entries
3. Намагайтесь робити ДЗ самостійно та не дивитися будьякі підказки */

/* ДЗ 13. Робота з обьектом
Опис ДЗ: Створіть об'єкт з щонайменше трьома властивостями (намагайтесь виявити фантазію).
Напишіть метод getInfo(), який виводитиме всі властивості об'єкта у вигляді пар "ключ: значення".
Зверніть увагу: метод повинен працювати навіть після додавання нових властивостей до об'єкта.
Наприклад так:
obj.getInfo(); // Правильна інформація про об'єкт
obj.newProperty = 'Нова властивість!'; // Додали властивість до об'єкта
obj.getInfo(); // Виводить всі властивості, включаючи щойно додану. */

/* ДЗ 14. Сума вартості послуг
Опис ДЗ: Припустимо, у нас є об'єкт. Властивості об'єкта - назва послуги та її вартість:
var services = {
"стрижка": "60 грн",
"гоління": "80 грн",
"Миття голови": "100 грн"
};
"Послуги" можуть додаватися по ходу роботи:
services['Розбити скло'] = "200 грн";

Умови виконання ДЗ
1. створити метод price(), який обчислює та повертає загальну вартість "наданих послуг".
2. створити метод minPrice() - який повертає мінімальний price
3. створити метод maxPrice() - який повертає максимальний price */